{
  "title": "\"PhilPapers\"",
  "short_title": "\"PhilPapers\"",
  "url": "\"https://philpapers.org/\"",
  "replication_url": "\"https://github.com/thoppe/The-Pile-PhilPapers\"",
  "min_year": "2009",
  "max_year": "2020",
  "language": "\"Mostly English (estimated 60-80%)\"",
  "file_information": {
    "uncompressed": {
      "filename": "data/PhilArchive.jsonl",
      "size": 2610566629,
      "last_modified_UTC": 1600398298,
      "sha256_hash": "e6f116532bbb74cb9ca52fd5b7b4cbba0f9aca804e75eebc46197590cd5a4f74"
    },
    "compressed": {
      "filename": "data/PhilArchive.jsonl.zst",
      "size": 797708027,
      "last_modified_UTC": 1600398298,
      "sha256_hash": "e90529b9b3961328d1e34b60534a8e0f73d5ad1f104e22a217de53cd53c41fea"
    }
  },
  "corpus_statistics": {
    "total_documents": 33990,
    "total_character_count": 2521946365,
    "total_word_count": 397013060,
    "max_character_count": 7789130,
    "min_character_count": 0,
    "max_word_count": 1180442,
    "min_word_count": 0
  },
  "sample_data": {
    "text": "On the Renormalisation Group Explanation of Universality Alexander Franklin∗† Abstract It is commonly claimed that the universality of critical phenomena is explained through particular applications of the renormalisation group. This paper has three aims: to clarify the structure of the explanation of universality; to discuss the physics of such renormalisation group explanations; and to examine the extent to which universality is thus explained. The derivation of critical exponents proceeds via a real-space or a fieldtheoretic approach to the renormalisation group. Building on Mainwood (2006), this paper argues that these approaches ought to be distinguished: while the field-theoretic approach explains universality, the real-space approach fails to provide an adequate explanation. ∗alexander.a.franklin@kcl.ac.uk †I would like to thank Bob Batterman, Jeremy Butterfield, James Fraser, Roman Frigg, Eleanor Knox, Mauricio Suárez, and anonymous referees, as well as audiences at the Oxford University Graduate Philosophy of Physics Seminar, BSPS Annual Conference 2015 and the 4th IrvinePittsburgh-Princeton Conference for thought-provoking comments and feedback. 1 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 1 Introduction Universality occurs when diverse systems exhibit similar scaling behaviour on the approach to a critical phase transition. Critical phase transitions mark the point (the critical temperature) beyond which systems no longer undergo first-order phase transitions. It turns out that this similar scaling behaviour can be very well described by power laws of the form ai(t) ∝ tα where t is proportional to the temperature deviation from the critical temperature and α is the critical exponent – a fixed number which leads to a characteristic curve on temperature-density plots.1 Physical systems can be categorised into universality classes according to their behaviour as they approach the critical point: members of the same class have identical critical behaviour – the same set of critical exponents {α, β, ...} for several power laws – while their behaviour away from the critical point and microscopic organisation may be radically different: fluids and magnets are in the same universality class despite otherwise having totally different chemical and physical properties! In fact, a paradigm example of universality is that the liquid-gas critical phase transition and the (uniaxial) ferromagnetic-paramagnetic critical phase transition share critical exponents (those of the 3D Ising class). Both of these types of systems may be described by equivalent power laws as they transition from certain ordered states (liquid or ferromagnetic respectively) to critical states. On the one hand a great deal of experimental evidence is available which classifies many different physical systems into a few universality classes, and finds the critical exponents to ever greater accuracy; see Sengers and Shanks (2009). On the other, theoretical work is continually under way to refine and develop the theoretical models for each universality class; see Pelissetto and Vicari (2002). Critical exponents derived both through computer modelling (Monte Carlo simulations) and field-theoretic derivations (using perturbation theory) closely match those discovered empirically. This paper has three aims: (i) to clarify the structure of the explanation of universality; (ii) to discuss the physics of the renormalisation group (RG) explanations; (iii) to examine the extent to which universality is thus explained. In §2 I outline a range of different explananda, and distinguish the kinds of explanation which may satisfy each. This is important because some confusion 1. E.g. the specific heat (in zero magnetic field) c scales as c ∼ (t−α)/α as t→ 0 where t = T−TcTc . 2 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 in the philosophical debate over the explanation of universality has resulted from implicit appeal to different explanatory standards. §3 details the physics of the real-space and field-theoretic approaches to the RG. I argue that the two approaches, which have different mathematical structures, offer distinct explanations. Paying attention to the physics further reveals that there are various technical lacunae in the RG explanation of universality, which have been neglected in the philosophical literature. In §4 I develop reasons for thinking that, despite various technical lacunae, the field-theoretic approach to the RG is sufficient to explain universality along the lines developed in §2. There I also express doubts that a similar argument could be run in the context of the real-space approach. In the physics literature it is standard practice to distinguish these two approaches; my aim here is to build on Mainwood (2006)'s insight that the distinction is also philosophically significant when assessing the RG explanation of universality. I, like Mainwood, endorse the field-theoretic explanation of universality while arguing that the real-space explanation is inadequate.2 However, my reasons for believing this are somewhat distinct from his: Mainwood is worried by the fact that the real-space approach makes use of non-renormalisable Hamiltonians while I query the extent to which the physics can demonstrate that different systems indeed exhibit similar behaviour; see §4 for more details. 2 Structure of the Explanation of Universality The discussants in the philosophical literature on the explanation of universality3 seem to have different standards of explanation in mind. As such, in the table below, I set out what I take to be the various phenomena which need explaining (explananda marked 'Q' for explanatory question) and the explanations offered in response (explanantia marked 'E' for explanation). The table is organised into 2. The field-theoretic approach is also known as the 'momentum-space', 'k-space' or 'Wilsonian RG' approach, it was primarily developed by Wilson and Fisher and is not merely the Fourier transform of the real-space approach, which was spearheaded by Kadanoff. Rather each approach involves a different, though related, set of techniques and physical models; see §3.2 for further discussion. 3. E.g. Batterman (2000; 2017), Butterfield and Bouatta (2011), Butterfield (2014), Callender and Menon (2013), Morrison (2014), Reutlinger (2014). 3 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 three rows: 'Spec' for specific explanations, 'Com' for common explanations, and 'Abs' for abstract explanations. Explananda (Q) Explanantia (E) SpecQ : System A has critical exponents {α} & system B has critical exponents {α} & ... & system E has critical exponents {α}. SpecE : {α} derived from Hamiltonian for system A & {α} derived from Hamiltonian for system B & ... & {α} derived from Hamiltonian for system E. ComQ : Systems A-E have certain behaviour in common (or the differences between A-E are irrelevant to their behaviour). ComE : Identify common features shared by A-E and show that they are sufficient for common behaviour (or demonstrate the irrelevance of heterogeneities). AbsQ : There's a generic commonality in behaviour (or a generic irrelevance of certain details). AbsE : The trajectories in the abstract space converge. SpecQ is a conjunction of seemingly independent facts about the critical exponents of different systems, where each fact is offered a distinct explanation by SpecE. SpecQ is distinguished from ComQ to emphasise that ComQ requires a deeper explanation. The common behaviour ought not to be explained by distinct explanations for each physical system; an explanation of the form of ComE is required which adduces a similarity in the systems and demonstrates its sufficiency for their common behaviour.4 Consider an analogy: a traveller visits a foreign country and goes from house to house observing the local customs. She observes an oddity in the locals' behaviour: in each family she visits, the youngest child sleeps in a bed angled such that their head is vertically lower than their feet. At each visit, she asks for an explanation of this phenomenon and every family offers a different answer: 'because he's short and this way he'll grow taller'; 'because greater blood flow to her head will increase her intelligence'; 'because it's cooler and his head otherwise becomes hot'; 'because that's the only way to avoid the awakening smell of dinner' . . . Our traveller will likely be dissatisfied with this range of distinct explanations – analogous to our dissatisfaction with SpecE. There is an unusual commonality 4. A similar point is made in Batterman (2016). 4 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 and she will seek a unified explanation along the lines of ComE. A straightforward way to offer an explanation of universality follows ComE: one explains the common behaviour by, first, isolating and pointing to an aspect of their descriptions which is shared by the different systems in the same class, and, additionally, demonstrating that the common features lead to the observed common behaviour. In §§4.1-4.2 I respectively claim that the field-theoretic approach provides a Common-type explanation while the real-space approach does not. What about AbsE? Batterman appeals to an explanation along these lines: commonality is to be expected generically because of the convergence of flows in the abstract space. \"It turns out that different physical Hamiltonians can flow to the same fixed point. Thus, their critical behaviors are characterized by the same critical exponents. This is the essence of the explanation for the universality of critical behavior\". (Batterman 2000, 127) Of course, this explanation is insufficient if the converging trajectories are not linked to the systems which exhibit the commonality. Batterman claims that the link is due to the flow of 'physical Hamiltonians', as such much of this paper will explore how physical Hamiltonians may be defined in the context of critical phenomena. That is, I explore whether we can link the abstract convergent flows to the description of distinct systems which exhibit universality. Without a link to the ComQ, AbsE remains a claim not grounded by reference to real physical systems. By analogy consider the claim 'communities tend to share cultural practices'. The claim would be explanatorily insufficient if it could not, at least in principle, be demonstrated that this community shares cultural practices. Importantly, for both the analogy and the universality of critical phenomena, Abstract-type claims may play an important explanatory role where the link to ComQ is available. I argue in this paper that the physics is much less worked out than the literature seems to suggest. Nonetheless we seem to have a framework available for an Abstract-type explanation with the field-theoretic approach to the RG: in §4.1 I show that there are sound theoretical arguments whereby the field-theoretic approach implies that convergent flows can be linked to trajectories in phase space which may represent the different physical systems which display common behaviour. Note that in the real-space RG context the formalism of convergent flows in 5 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 a phase space can also be written down. There is, however, little reason to think that the distinct convergent trajectories represent the different physical systems of interest; although there are limited exceptions discussed in §4.2. As such, I argue that the AbsE explanation fails for the real-space RG because it does not have the resources to imply ComQ. The real-space RG does, nonetheless, allow for the prediction of the critical exponents for certain (archetypal) systems in each universality class and can thus provide SpecE for some systems. It may help to tie the difference in explanations provided by SpecE and ComE to a particular theory of explanation.5 On the interventionist approach advocated by Woodward (2003, 2016), explanations answer what-if-things-had-been-different 'w-questions'. Answers to w-questions require us to describe the chain of dependencies which lead to the explananda and to demonstrate how the explananda would change given variation of various factors. SpecQ requires us to consider which features, if different, would prevent system A exhibiting behaviour with critical exponent α . . . ; ComQ, on the other hand, asks what changes would lead to the common behaviour no longer being common. In other words, ComQ doesn't really care about precisely what happens to the individual systems; it prompts an explanation as to why they share features, which motivates us to locate a shared property, and to demonstrate that sharing that property is sufficient for the common behaviour in question. The claim that the sharing of behaviour is merely coincidental is inconsistent with any non-trivial ComE, but is compatible with an interesting SpecE. There is a further issue which ought to be mentioned here – this pertains to the parenthetical statements in the table above. Batterman (2000, 127) highlights the fact that the RG formalism allows one to demonstrate the irrelevance of aspects of our physical systems. What's important for Batterman is that the RG thus provides a robustness demonstration.6 He claims that robustness with respect to microphysical perturbations implies that all systems which go to the critical point have a representation that's independent of microphysical details. This would thus establish that the distinguishing details are irrelevant and, by implication, 5. Overall I expect the RG explanation of universality to be compatible with any theory of explanation which accepts these distinctions. However, I think it best suited to counterfactual approaches (such as the interventionist one) because these allow for higher level explanations – see brief discussion in §4.1 – and, unlike causal-mechanical explanations, these can readily make sense of explaining why a trait is shared across a class of systems. 6. Batterman and Rice (2014) refers to the robust mathematical representation as a 'minimal model'. The literature on this issue is rather thorny and I will not discuss it further here, though I would refer the interested reader to Jansson and Saatsi (2016). 6 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 that the common details are sufficient for common behaviour. This robustness demonstration is rather like that of type AbsE. In order for it to explain universality we need an additional demonstration that the behaviour of the different physical systems of interest is, in fact, described by the robust model. Throughout the rest of this paper I discuss the extent to which such arguments might succeed. While other authors seem to ignore the conceptual links between irrelevance of details and universality, Batterman's work is very important for its role in highlighting these connections. My contention in this paper is that the field-theoretic RG is the proper context for gleaning such insights. The upshot of this section is that we have a framework for explaining universality: we may either proceed via ComE, or via AbsE , provided that an appropriate link to ComQ is available. The philosophy literature which refers to universality has a number of aims with respect to establishing theses about emergence, reduction and explanation. My goal, here, is merely to clarify the nature of the RG explanation; thus I will not presume to comment on such theses and interpretative issues, though I hope that this paper will shed light on future discussions. Although I assume that any theory of explanation adequate to explanations of universality will accept the distinctions elaborated above, I do not have space to provide a substantive analysis of the right theory of RG explanation. However, I should note that neither ComE nor AbsE requires that we use the RG mathematical framework, rather than some other means, for variously determining the relevance and irrelevance of different parts of the mathematical representation of the physical systems of interest; this observation may count against claims that RG explanations are sui generis. 3 The Physics The following two sections involve some technical detail; overall I claim that the two approaches to the RG provide different putative explanations of universality and that, as such, they ought to be distinguished. For the real-space approach I claim that critical exponents are derived based only on a representative model for each universality class. A model is not provided for each member of the same class and it is not demonstrated that the details which distinguish each member of the same class are irrelevant to that system's critical behaviour. In addition, I argue that the mathematical model employed is insufficiently general to represent the common aspects of all members of the uni7 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 versality classes; thus a Common-type explanation is not available. Here, universality is not explained but assumed: no justification is given for the applicability of the models to the other members of each class. This conclusion is reached through consideration of the models and a sketch of the RG methods by which the critical exponents are derived for each such model. In §4.2, I consider three responses to this assumed-not-explained objection; in all three cases I express doubts that the behaviour of the broad range of systems which exhibit universality could be thus explained. The field-theoretic RG makes use of a renormalisable Hamiltonian. I argue that this provides it with the tools to describe the commonalities in the various systems sufficient for their common behaviour. The RG techniques then allow one to class all differences between systems so represented as irrelevant to the values of their critical exponents. As such, the field-theoretic RG provides a Common-type explanation: common features are identified and other features are demonstrated to be irrelevant. The standard account of this explanation implicitly depends on physics which has not been worked out, as such it includes certain technical lacunae. These correspond to our in-practice inability to formulate Hamiltonians which represent the details that distinguish systems within the same universality class. Nonetheless, unlike in the real-space case, we have theoretical justification for the claim that such distinguishing details are irrelevant. In §4.1 I further discuss the gaps in the physics and adduce reasons to consider the field-theoretic RG explanation adequate. Overall: the real-space RG provides a Specific-type explanation for a few individual systems but does not achieve ComE. It looks like we can draw diagrams which provide AbsE as well, but the abstract picture of convergent trajectories fails to correspond to real physical systems in the same universality class. Conversely the field-theoretic RG explains along the lines of ComE (where the common features are representation by the Landau-Ginzburg-Wilson Hamiltonian and the order parameter), and allows one to justify AbsE. 3.1 The Models The critical behaviour of the different universality classes can be derived from a range of simple model systems. I briefly describe the Ising model, and its extension to the n-vector model, which defines a broad range of models classified according to their values for two variables. This model is crucial to understanding 8 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 the real-space RG, and is abstracted to provide the basis for the field-theoretic RG. Microphysical models are not defined for multiple members of the same universality class, rather a representative model is used for each class. Niss (2005) describes the early history of the Lenz-Ising model.7 The Ising model was specifically designed to represent the physical characteristics of magnetic systems rather than the broader range of systems which display critical phenomena. According to the model such systems are composed of an array of interacting micromagnets which have a discrete range of orientations. This latter assumption arose out of a combination of empirical data and considerations from early quantum mechanics. In modern formulations the Ising model consists of a D-dimensional cubic lattice with {ei} basis vectors with sites labelled k = (k1e1, . . . , kDeD). At each site there is a spin variable σk ∈ {−1, 1}, though in extensions to this model the spin variable can take a greater range of values. A Hamiltonian is defined: H = −J ∑ k,k+μ σkσk+μ −B ∑ k σk (1) The coupling constant J takes a positive value and is assumed to be independent of all variables other than the system volume. The Ising model interaction is generally defined over nearest, or next-nearest neighbours, thus μ is a lattice vector which takes any vector to the relevant neighbour in the positive direction. B is an external magnetic field. The Hamiltonian of a system corresponds to the energy of the system in a particular configuration, thus we see (as is confirmed empirically) that the Ising Hamiltonian will take a lower value when the spins are aligned, and a higher value when spins are disordered. The ferromagnetic-paramagnetic transition can be defined over this lattice as the transition from the spin configuration with all spins aligned to that where there is no general correlation between the spin directions. This transition will take place at the critical temperature (Tc). No analytic derivation of critical behaviour for any three-dimensional model has been achieved.8 7. Henceforth: 'Ising model', although Niss points out that Lenz and Ising jointly proposed it in 1920 and 1924. The model provides crude approximations to the properties of real ferromagnets but captures their key qualitative features. 8. Onsager (1944) derived power law behaviour for a two-dimensional Ising model. 9 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 Behaviours characteristic of systems approaching Tc are termed 'critical phenomena' and it is with respect to the power laws which describe such behaviour that universality can be observed. Current mathematical procedures to describe such behaviour involve the Renormalisation Group (RG), described below. The nvector model generalises the Ising model to various universality classes. Stanley (1999, S361) notes: \"empirically, one finds that all systems in nature belong to one of a comparatively small number of such universality classes\". The n-vector model includes spins which can take on a continuum of states. H(d, n) = −J ∑ k,k+μ σk * σk+μ −B ∑ k σk (2) Here, the spin σk = (σk,1,σk,2, ...,σk,n) is an n-dimensional unit vector. The two parameters which determine the universality class are the system dimensionality d (which will determine the set of nearest neighbours) and the spin dimensionality n. The standard, three-dimensional Ising model corresponds to H(3, 1) as it describes three-dimensional magnets which, in the ferromagnetic phase, will have spins either aligned or anti-aligned with a single axis.9 I now turn to a discussion of the RG derivation of critical exponents. A full exposition would require more space than we have here but I sketch the procedure below.10 RG transformations are constructed to preserve thermodynamical properties of the system of interest while increasing the mean size of correlations. Thus, for example, the RG transformations take a ferromagnetic system towards the critical point (where the order parameter fluctuates wildly). 3.2 Field-Theoretic and Real-Space Renormalisation The different RG approaches posit competing methods for deriving critical exponents: Real-space RG: Consider the Hamiltonian of a system on a lattice (e.g. in the Ising model). The higher energy interactions will probe the structure of the lattice, and, in order to consider the system probed at a larger length-scale, we average over the higher energy contributions to the Hamiltonian. This can be done by in9. By contrast, isotropic systems will be described byH(3, 3). 10. For more details see Binney et al. (1992), Cardy (1996), and Fisher (1998). 10 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 creasing the effective lattice size and constructing a new Hamiltonian for a system on a larger lattice – referred to as 'coarse-graining' or 'zooming out'. This may be thought of as a blocking procedure, whereby some group of particles is replaced by one particle which represents the group through an average or suchlike; see figure 2.11 On this model the RG flow represents the changes in parameters which leave the form of the Hamiltonian, and certain qualitative properties of the system unchanged (i.e. those which are derived from the partition function), while increasing the lattice size. Monte Carlo computer based methods allow for the derivation of the critical exponents from the n-vector Hamiltonian (equation (2)) via the real-space RG. Field-theoretic RG: The Hamiltonian (equation (5)) considered in this case is more abstract (technically it is a functional of the order parameter (OP)) – I outline one way of deriving it below. The calculation of this Hamiltonian for real systems involves integration over a range of scales and energies. The highest energy (smallest scale) cut-off (denoted Λ) corresponds to the impossibility of fluctuations on a scale smaller than the distance between the particles in the physical system. The RG transformation in this case involves decreasing the cut-off, thus increasing the minimum scale of fluctuations considered. This procedure is analogous to increasing the lattice size and will similarly generate a flow through parameter space designed to maintain the Hamiltonian form and qualitative properties of the system in question. Both approaches to the RG can be formalised as follows. The RG transformationR transforms a set of (coupling) parameters {K} to another set {K ′} such that R{K} = {K ′}. {K∗} is the set of parameters which corresponds to a fixed point, defined such that R{K∗} = {K∗}.12 If we assume that R is differentiable at the fixed point this leads us to a version of the RG equations. K ′a −K∗a ∼ ∑ b Tab(Kb −K∗b ), where Tab = ∂K ′a ∂Kb ∣∣∣ K=K∗ (3) There are now two more steps before we can define relevance and irrelevance. 11. A variety of acceptable blocking methods are discussed by Binney et al. (1992). 12. A fixed point of scale invariance can only be located by taking the thermodynamic limit, or by iterating the RG transformation infinitely. These idealisations motivate much of the discussion in the philosophical literature on universality; see e.g. Batterman (2000). My aim here is not to settle such questions, rather I hope to get clear on how the explanation works, and to leave the question of reduction for another occasion. 11 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 Firstly we define the eigenvalues of the matrix Tab as {λi} and its left eigenvectors as {ei}. Scaling variables (ui ≡ ∑ a e i a(Ka − K∗a)) are linear combinations of the deviations from the fixed points. By construction these scaling variables will transform multiplicatively near the fixed point such that u′i = λiui. The second (trivial) step is to redefine the eigenvalues as λi = byi where b is the renormalisation rescaling factor and yi are known as the RG eigenvalues. If yi > 0 then ui is relevant; if yi < 0, ui is irrelevant; and if yi = 0, ui is marginally relevant. The relevant scaling variables will increase in magnitude after repeated RG transformations while the irrelevant scaling variables will tend to zero after multiple iterations. (The behaviour of the marginal scaling variables requires more analysis to determine.) Thus, given the Hamiltonian of one of our models, one can define an RG transformation which will allow one to: (i) classify certain of the coupling parameters of the system in question as (ir)relevant to its behaviour near the fixed point, (ii) extract the critical exponents from the scaling behaviour near the fixed point. Up to this point the description is generic. Note that in the real-space approach the coupling parameters to the Ising-type Hamiltonians are marked as relevant or irrelevant while in the field-theoretic approach it's the operators – functions of the OP – which are so labelled. The real-space RG depends on the application of a blocking transformation, a standard example is depicted in figure 2, though almost any blocking transformation would do equally well. It is required that the Hamiltonian form is stable across these transformations. Since the Hamiltonians are not renormalisable this involves the application of a transformation and subsequent truncation of the Hamiltonian.13 The field-theoretic RG approach derives the critical exponents using diagrammatic perturbation theory – I do not have space to elaborate this here. The Hamiltonian in this context is macroscopic and depends on the OP (φ) which, in the Ising model context, is a sum of the spins in a small region of volume δV at x: φ(x) = μ δV ∑ i∈δV σi. 14 We require that a δV l where a is the physical lattice 13. It is these truncations which motivate Mainwood (2006)'s dismissal of the explanation on offer by the real-space RG. I discuss this further in §4. See §4.2 for my distinct critique of the real-space RG explanation. 14. φ is the thermal average of the OP φ(x, t). This quantity has a system-dependent definition. E.g. in liquid-gas transitions φ(x) ≡ ρ(x)− ρgas(x) where ρ(x) is the average density in a volume centred on x, and ρgas(x) is the time-averaged density for the gas at the temperature at x. Clearly, below Tc for gaseous systems and above Tc in general φ ≈ 0, but below Tc for liquid systems φ > 0. For HeliumI-HeliumII transitions the OP is ψ(x) which represents the quantum amplitude to 12 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 spacing and l is the dominant statistical length (often the correlation length). One can approach its construction from the Ising model as follows (see Klein, Gould, and Tobochnik 2012):15 Start with the Ising model (equation (1)); then postulate a form for the Helmholtz free energy F(φ) of a system in contact with a heat bath. The terms in equation (4) correspond (a) to the interaction of the coarse-grained Ising spins with an external magnetic field, (b) the interactions between the coarse-grained spins which depends only on the distance between blocks and (c) an approximation of the entropy (using Stirling's approximation). F = U − TS. F(φ) = − (a){ }} { B ∫ φ(x)dx− (b){ }} { 1 2 ∫∫ J(|x− y|)φ(x)φ(y)dxdy − kBT (∫ [1 + φ(x)] ln(1 + φ(x))dx + ∫ [1− φ(x)] ln(1− φ(x))dx} {{ } (c) ) (4) After only a few steps, and a generalisation to dimension d one ends up with the Landau-Ginzburg-Wilson (LGW) Hamiltonian in equation (5). H = ∫ ddx [1 2 ζ2|∇φ(x)|2 + 1 2 θ|φ(x)|2 + 1 4! η|φ(x)|4 ] (5) Note that the LGW Hamiltonian is not the Ising model effective Hamiltonian. This latter object is more complicated, however it is demonstrated in Binney et al. (1992, Appendix K), (and is plausible given its derivation) that equation (5) is a good approximation to a truncated form of the Ising Hamiltonian near the critical point. The construction of equation (5) is quite different from equations (1-2). It builds on these models but abstracts from them. More details can be found in (e.g.) Fisher 1974. There he demonstrates the field-theoretic methods which allow one to derive expressions for the critical exponents as functions of d and n, see find a particle of HeII at x; for conductor-superconductor transitions ψ(x) represents the quantum amplitude to find a Cooper pair at x. 15. There are many different derivations of this Hamiltonian which speaks to its generality. See Binney et al. (1992) and Goldenfeld (1992) for alternatives. 13 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 equation (6) for the first few terms of the exponent α; this will give a value for various universality classes. This derivation depends on the functional integration of the LGW Hamiltonian over all functions φ(x). α = 4− n 2(n+ 8) (4− d) + (n+ 2) 2(n+ 28) 4(n+ 8)3 (4− d)2 + ... (6) Crucially, it can be shown that the addition of certain terms to the LGW Hamiltonian will lead to irrelevant contributions; these do not affect the values for critical exponents describing the approach to a given fixed point. In Binney et al. (1992, Ch.14) the criteria for relevance and irrelevance are derived. An operator Op is relevant if p−d(p−2)/2 > 0 and irrelevant if p−d(p−2)/2 < 0 where d is the dimension of the system under investigation and p is a function of the exponent of φ.16 This serves to establish that for the LGW Hamiltonian, for d = 3, any Op with p > 6 will be irrelevant at the fixed point.17 This is an important result for the discussion in the remainder of this paper. Its generality depends on the justification for the applicability of the LGW Hamiltonian to various models. As we will see in what follows this will depend in part on the OP assigned to each member of each universality class. The theory behind this result is relatively involved, but the idea is simple: the LGW Hamiltonian is renormalisable. This means that applying an RG transformation to the Hamiltonian will not add terms which cannot be absorbed into the parameters ζ, θ, η in equation (5). Renormalisable Hamiltonians are in some sense scale-invariant: renormalisability implies independence of the details of the cutoff. The fixed point – which describes the location of the critical phase transition – is itself a point of scale invariance as it is unaffected by RG transformations.18 Thus, at the fixed point, the only elements which are relevant and contribute to behaviour are those in the renormalisable Hamiltonian. All other terms which may be added to that Hamiltonian will consequently be irrelevant or marginally relevant. By contrast, the Hamiltonians employed in the real-space approach are not 16. It is formally defined as follows: Op ≡ ∫ ddxλp ∑p/2−1 m=0 (−1)m Cm (p−2m)!φ p−2m where where Cm ≡ 12mm! ( ∫ Λ ddq ζ2q2 )m. 17. Odd powers of φ are generally excluded for reasons of symmetry. For d = 3 it can be established perturbatively (at least to low orders) that O6 is also irrelevant. 18. This corresponds physically to the divergence of the correlation length in critical systems, as such it requires the thermodynamic limit; see fn. 12. 14 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 renormalisable and the description of their behaviour near the critical point relies on the imposition of scale invariance by truncating the Hamiltonian after each iteration of the RG transformation; as such, criteria for relevance and irrelevance of additions to those Hamiltonians cannot be specified in such generality. The next section will explore the extent to which each RG approach can be considered to explain the universality of critical phenomena. 4 Universality Explained? Universality is explained if we are able to show that each member of each universality class has features in common and to demonstrate that having those features is sufficient for the universal behaviour – that is an explanation along the lines of ComE ; see §2 for my taxonomy of explanations. Universality may be equally well explained by the convergence of flows in an abstract space, so long as we can draw a connection between such flows and the physical systems of interest. In this section, I build upon the details of physics given thus far. I argue that the field-theoretic explanation is adequate (§4.1) but that the real-space explanation is inadequate both to Commonand Abstract-type explanations (§4.2). My claims here follow those of Mainwood (2006, 152-187) who argues that the real-space and field-theoretic approaches should be distinguished when assessing the RG explanation of universality. Mainwood shows that on the real-space approach one can only derive universality if one imposes the same RG transformations on each member of the same universality class, and that the choice of such transformations for each model is, in some sense, up to us – this follows from the non-renormalisability of the Hamiltonians used. Mainwood thus claims that the real-space approach fails to provide an adequate explanation. I suggest that the real-space approach cannot explain universality for a more basic reason: it fails to represent the diverse range of systems which fall into the same class and thus does not demonstrate a flow of different systems into the same fixed point; I discuss this further in §4.2.19 Mainwood's claims may bolster my 19. My claims require that representation involves more than scientific fiat; it requires the discovery of correspondences between parts of the model and parts of the world, and the detailed demonstration that the corresponding parts instantiate similar relations. That is, the dependencies in the model must accurately capture some of the worldly dependencies, to an appropriate level of detail. For a candidate theory of representation along these lines see Bueno and French (2011). 15 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 own to the extent that even were the real-space RG to model each distinct system one would still have grounds for doubting the explanation of universality on offer. In addition to my worries about the real-space RG, I argue that the standard characterisation of the field-theoretic RG explanation of universality adverts to physics which is somewhat less developed than first appears. Below, I highlight these technical lacunae and demonstrate that they ought not overly to bother us. Where the explanation of universality is presented, it is commonly claimed (e.g. Kadanoff 2013; Batterman 2017) that we proceed by including the details of diverse physical systems in the mathematical representations and showing these to be irrelevant. Such arguments are often represented pictorially, see figure 1, and described as follows: \"The distinct sets of inflowing trajectories reflect their varying physical content of associated irrelevant variables and the corresponding non-universal rates of approach to the asymptotic power laws dictated byH\". (Fisher 1998, 675) Multiple systems in the same universality class are represented at the critical point by the LGW Hamiltonian (equation 5). In order to represent the details which distinguish such systems we would need to add irrelevant operators to that equation. This is not done for the specific systems which fall into the same universality class. In practice, it is not known how to model such systems, for the explicit formulation of effective Hamiltonians is a non-trivial task.20 Thus each distinct trajectory of figure 1 cannot be explicitly related to the real, physical systems whose behaviour is captured. In principle one could also write down any microscopic Hamiltonian but, as I argue in §4.2, we cannot show that different systems thus represented will exhibit universal behaviour. On the other hand, we can, with the field-theoretic approach, show that any system which satisfies certain symmetry and dimensionality conditions will exhibit universal behaviour. 4.1 Field-Theoretic RG We have sound theoretical reasons to think that the LGW Hamiltonian represents a wide range of physical systems. The physical analysis behind this claim is the renormalisability of the LGW Hamiltonian and the demonstration that certain 20. See Vause and Sak (1980) for some considerations regarding the formulation of an effective Hamiltonian for liquid-gas systems; Binney et al. (1992, Appendix K) details the complex task of constructing the Ising effective Hamiltonian. 16 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 Figure 1: The RG flow in the abstract space of Hamiltonians (or, more precisely, the space of couplings for a fixed Hamiltonian form). Figure from Fisher (1998). 17 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 classes of operators are irrelevant, as discussed above. Binney et al. (1992, 366) express this as follows: \"to the accuracy of our calculation we have shown that any three-dimensional physical system whose Hamiltonian can be written as an even functional of a one-component scalar field should have the same critical behaviour as the Landau-Ginzburg model.\" Thus we need to show, for each system of interest, that its order parameter (OP) can be written as a one-component scalar field. Paying close attention to the OP of each system will also ground the various assignations of systems to different universality classes. The OP accounts for the symmetry group (i.e. the n of the nvector model) and the dimensionality. Defining the OP for a condensed matter system is not a straightforward process, it depends subtlely on the kind of phase transition the systems undergoes, and on which macroscopic features change at such a phase transition. Footnote 14 provides some examples of various OPs. The central operators of the LGW Hamiltonian together with the OPs represent the common aspects of the various systems in the same class at the critical point. Such systems are distinguished, at most, by operators which are, by RG arguments, irrelevant to the behaviour at the critical point. Thus the common aspects are sufficient for the systems' exhibiting universal behaviour and we have a Common-type explanation. Furthermore, this, in principle, justifies AbsE: the various systems are represented by Hamiltonians distinguished by irrelevant operators and the flows of the distinct systems converge at the fixed point. One might have the following worry: once the OP has been specified, common representation is assured for the different systems in the same class. As such, specification of the OP might be said to do all the explanatory work. I don't think that this argument goes through. I claimed in §2 that ComE explanations must identify common features and show that they are sufficient for common behaviour.21 The OP, together with the LGW Hamiltonian, represent the common features of the different systems, but the field-theoretic RG framework is required to demonstrate that such operators are sufficient for the universal behaviour and that all other aspects of the descriptions are irrelevant at the critical point. Part of this explanation does lie in the matching of OPs to systems but it also relies on the fact that all the non-renormalisable operators, which otherwise represent the differences between systems' behaviour away from the critical 21. Indeed, one reason to think the interventionist approach is particularly appropriate to the explanation of universality is that Woodward (2016) emphasises that explanations are deficient if the relation between the explanans and explanandum cannot be shown. 18 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 point, are irrelevant at the critical point. This is non-trivial; in some contexts the irrelevance of certain details may be obvious, and thus may remain implicit, but where it isn't obvious demonstrations of irrelevance play an important role in the explanation. It's also worth noting that, even were this point not granted, the OP doesn't play a role in the real-space approach and, as such, it is only through the field-theoretic approach that we are able to identify the common features of universally behaving systems. A further concern with this explanation rests on the observation that the OP and LGW Hamiltonian correspond to large-scale features of the systems of interest, thus our explanation is not tied in detail to systems' microscopic heterogeneities. So long as we have reason to believe that our model represents the different systems which exhibit universality, the explanation needn't include all the details of each system; it has long been acknowledged that good explanations may abstract from underlying details (see e.g. Woodward 2016).22 We do have good reasons to link field-theoretic models to the physical systems of interest, chiefly: a microscopic justification of the choice of OP; discussion of irrelevant operators – continued below; and the empirical observation of approximate scale symmetry in physical systems at and near the critical point. Further justification akin to that provided by the derivation of the LGW Hamiltonian from the Ising model – see §3.2 – may provide a bottom-up account of critical phenomena, though this claim is subject to worries about the infinite idealisations invoked; see fn. 12. I assume that unreduced explanations can be shown to be adequate before such questions of reduction are settled. That we cannot, in practice, write down the irrelevant operators may be worrying. It may be thought that evidence is scant for the claim that such operators indeed represent the heterogeneities which distinguish physical systems away from the critical point. I hope partially to alleviate such worries by briefly considering crossover theory.23 The theoretical description of crossover tells us that in some cases we may derive a correspondence between certain operators and the details of physical 22. The fact that no currently available explanations of anything are truly fundamental implies that some adequate explanations may leave out lower-level detail – that's sufficient to block the rejection of the field-theoretic RG explanation solely on the grounds that it is not microscopic. 23. This has been appealed to by Mainwood (2006), Callender and Menon (2013), and Butterfield and Bouatta (2011) with a view to deflating claims of emergence in the context of critical phase transitions. My claims here are distinct from those and ought to be far less contentious. 19 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 systems. By showing that certain operators may represent the details which distinguish systems away from the critical point, this ought to bolster the analysis of the field-theoretic RG explanation presented just above. Systems undergoing crossover display critical behaviour characteristic of some universality class as they approach Tc, but under repeated iterations of the RG transformations (read: as the temperature moves closer to Tc) they deviate from that behaviour and cross over to a different universality class. For example a system near the Heisenberg fixed point may have an additional relevant operator, we might thus define a Heisenberg-type (n = 3) Hamiltonian including operators for isotropic and anisotropic couplings. It turns out that a system so described will cross over to Ising-type behaviour; for further details see Fisher (1974) and Cardy (1996). Crossover theory is empirically successful, and such successes are predicated on deriving a relationship between operators and the details of physical systems. Although the operators for which such a correspondence can be shown are not irrelevant – these are relevant or marginally relevant operators – such correspondences help to establish that operators may play the required role in the fieldtheoretic RG explanation of universality. For most instances of universality we have yet to discover irrelevant operators which are physically interpreted as representing those features which distinguish multiple members of the same class. The phenomenon of crossover does suggest that such differences can be modelled. This in turn justifies the claim that the fieldtheoretic approach explains the universality of critical phenomena: it identifies shared features in our systems of interest (represented by the LGW Hamiltonian) sufficient to predict their display of the critical exponents. The expanded Hamiltonians with the irrelevant operators, together with the flow induced by the RG, may be depicted as in figure 1 and thus explain universality. Is universality thus explained? I claimed above that one way to explain universality is by constructing a map between convergent flows and real physical systems (akin to AbsE ). However, as noted above, no map can be explicitly constructed in this case since we do not know how to write down the irrelevant operators for the various systems of interest. Thus an explanation of type AbsE with the necessary link to ComQ may be found only in principle; in practice ComE goes through. 20 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 Figure 2: This demonstrates a single application of the real-space RG where a block of spins is replaced by a single larger spin. Figure from Fisher (1998). 4.2 Real-Space RG The real-space RG may be understood by appeal to simple diagrams like that in figure 2. It is thus unfortunate that, as I argue in this section, the explanation provided by the real-space RG is inadequate. The real-space approach allows for the derivation of critical exponents consistent with empirical observation for various models. Furthermore we have an account of relevance and irrelevance and the claim that: \"In general, for fixed points describing second-order critical points, there are two relevant parameters: the temperature and the field conjugate to the order parameter (for the magnet it is the magnetic field)\". (Cheung 2011, 51) Why is this explanation of universality not sufficient? In §2 I categorised a few options for how universality may be explained. I claimed that SpecE was insufficient but ComE or a supplemented AbsE could do the job. I think that neither latter option is live in the real-space case. This is because the mathematical model employed does not have the tools to represent systems other than the archetypal system for each universality class; the problem is that the Ising model is designed specifically for magnetic systems. In the following I explore a number of ways it might be adapted to represent other members 21 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 of its class: Kadanoff's proposal and the lattice-gas analogy. I conclude that none of these adaptations allows for a general RG explanation of universality: insofar as the correct critical exponents are predicted, this is done for individual systems and a Common-type explanation is unavailable. While the field-theoretic approach makes use of a Hamiltonian derived from the Ising model, the Hamiltonian used in that approach is renormalisable. As such it includes a scale-invariant core at the critical point which represents a range of different systems. That's how ComE is achieved: by showing what's in common and the general demonstration that all possible distinguishing features are irrelevant. The real-space approach does not make use of a renormalisable Hamiltonian, nor does it have a formalism which establishes generally that the Hamiltonians apply across a wide range of systems. Likewise there seems to be little hope that a picture like that in figure 1 can be shown to correspond to distinct systems in the same universality class having convergent flows; the reason is that the real-space approach relies on Ising-type models, which do not represent the other systems in the same class – the lattice-gas analogy provides a possible counter-argument, discussed below. To claim that Ising models in fact represent all the different systems would be to assume universality rather than to explain it. Whilst one may be able to demonstrate that each system in the same universality class shares certain features – e.g. symmetry and dimensionality – the real-space approach doesn't provide the resources to demonstrate that such commonality leads to common behaviour in general: we don't have an argument available on the real-space approach that common symmetry and dimensionality is sufficient for universality.24 Thus commonality sufficient for common behaviour can not be adduced for a Common-type explanation, nor can an AbsE-ComQ link be established. It is only by recourse to the field-theoretic approach that a full explanation of universality is available. Three responses to these claims ought to be considered: Firstly, it could be noted that irrelevant couplings are discussed in the realspace context, and we know that only a few, relevant couplings determine the critical exponents, thus perhaps these relevant couplings provide the ComE explanation. But the model is still tied to the details of the system it was created to represent. Thus the irrelevant couplings are those aspects of that system which will not affect its critical exponents. To show that some aspects of a given system are 24. I do not wish to claim that such an argument is, in principle, unattainable; rather that one has not been provided, and that developing such an argument would not be trivial. Thanks to an anonymous referee for pressing me on this point. 22 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 irrelevant to its behaviour in a given context, is quite different from showing that all systems with the same relevant properties (and with different properties otherwise) will display the behaviour. The former, system-relative claim is established by the real-space RG, but the latter more general claim is not. The success of the field-theoretic RG explanation is due to the fact that we can categorise operators as relevant or irrelevant quite generally. In the real-space RG potential couplings are only categorised for a given model; as such AbsE-ComQ is unavailable. Secondly, since the blocking transformation is tailored specifically to the behaviour of systems at criticality, the transformation itself might represent the common features for ComE. The transformation is constructed so as to mirror the self-similarity of such systems and its application to systems at criticality is thus justified. This would mean that the real-space RG explains universality by appeal to the fact that all these systems have some commonality, i.e. their self-similarity, which justifies the use of these techniques to derive their critical exponents. The problem with this claim is that the real-space RG approach does not simply derive the exponents from the blocking transformations. In fact, such exponents are derived by applying the blocking transformation and then truncating the Hamiltonian so that it will retain its original form. As such, the original Hamiltonian significantly determines the application of the real-space RG and the exponents derived. It is thus not quite right to claim that self-similarity is a common feature sufficient for universality. Moreover, if one considers the phenomenon of crossover, it's clear that this depends specifically on the terms in the Hamiltonian of each system. I raise this here as evidence that the initial Hamiltonian is crucial to the real-space derivation and explanation. As such, the appeal to a common blocking RG transformation cannot provide a Common-type explanation. Thirdly, for the remainder of this section I consider a pair of specific elaborations of the real-space RG approach which provide limited explanations of universality. The first demonstrates that critical exponents derived on the real-space approach do not depend on certain couplings in the Ising model. The second – the lattice-gas analogy – relates liquid-gas to magnetic models. Neither, I argue, provides a general account of the range of classes and systems which behave universally. Such general accounts are presently unavailable. Batterman (2016) highlights an argument found in Kadanoff (1971) to the effect that one can introduce a parameter λ into the free energy function for the Ising model, and it can be demonstrated that the critical exponents do not depend on the value of this parameter. In Kadanoff's example this parameter corresponds to 23 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 the ratio of the couplings for nearest-neighbour to next-nearest-neighbour models. As such we may be assured of a particular kind of generality of the Ising model representation. The independence of the critical exponents from such parameters is, however, insufficient to establish the requisite generality for the realspace approach. If a similar argument were available for the variation between a liquid-gas system and a magnetic system then this explanation would be far more convincing; such an argument has not yet been presented. The lattice-gas analogy exemplifies a possible mapping which may provide reasons to view the Ising model as representing liquid-gas systems in addition to magnetic systems. If this succeeds it would justify a Common-type explanation for the limited case at hand. However, it would not justify claims to an RG explanation of universality because the mapping is not one sourced in the relevance and irrelevance criteria of the RG. Rather it would provide a distinct explanation of universality. Furthermore, it is not generalisable to other members of the various universality classes. In both respects the field-theoretic approach outdoes the real-space approach even with the lattice-gas analogy. The lattice-gas model is summarised as follows: Consider the Hamiltonian H = −4J ∑ 〈ij〉 ρiρj − μ ∑ i ρi, (7) where ρi = 0, 1 depending if the site is empty or occupied, and μ is the chemical potential. If we define σi = 2ρi − 1, we reobtain the Isingmodel Hamiltonian with B = 2qJ + μ/2, where q is the coordination number of the lattice. Thus, for μ = −4qJ , there is an equivalent transition separating the gas phase for T > Tc from a liquid phase for T < Tc. (Pelissetto and Vicari 2002, 554) This mapping is clear enough, but merely shifts the burden of justification. As Pelissetto and Vicari acknowledge \"The lattice gas is a crude approximation of a real fluid\" (ibid.). Their justification for this approximation is empirical: \"Nonetheless, the universality of the behavior around a continuous phase-transition point implies that certain quantities, e.g., critical exponents ... are identical in a real fluid and in a lattice gas, and hence in the Ising model.\" In the context of its original presentation the model is provided the following rationale: 24 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 \"[t]heoretically speaking, by making the lattice constant smaller and smaller one could obtain successively better approximations to the partition function of the real gas\". (Lee and Yang 1952, 412) Although gases may often be modelled as continuum gases, this is itself an idealisation which requires a physical justification. Furthermore, the problem with the application of the Ising model to a physical gas is not that the Ising model is discretised – we expect gases to contain finitely many particles. Rather one should be concerned that the molecules have more degrees of freedom available to them than the components of uniaxial magnets. This is not to suggest that idealised models are intrinsically problematic, rather I am sceptical that this physical justification of the analogy is sufficient to explain universality. If we were to accept this justification of the lattice-gas model further questions would be raised: for magnets and liquid-gas systems do not display the same behaviour away from the critical point. It is precisely because the systems behave so differently much of the time that universality is startling. Thus, even if the latticegas analogy gave a good account of liquid-gas systems at criticality, additional details are needed to explain the limited applicability away from criticality. Do we have an explanation why these different systems undergo similar behaviour near the critical point? It turns out, and this is surprising and interesting, that uniaxial magnets and fluids have some behaviour which is approximately described by the same model: namely the Ising model. But this result is a consequence of careful mapping between the systems; it was not an RG result. The RG was used for the derivation of the critical exponents from the models, not in the justification of the applicability of the models to various physical systems. The lattice-gas analogy provides an account of what's in common between systems with diverse microphysics by mapping the Ising model to a liquid-gas model. However, no generalised real-space RG explanation is available which tells us why all the members of the same class have identical behaviour. On the field-theoretic approach we were able to identify common features and demonstrate their sufficiency for common behaviour – that's how ComE was achieved; on the real-space approach, insofar as we can derive the same critical exponents for different systems, we still have no characterisation of their common features which would serve to demystify universality. I do not purport to rule out real-space explanations in principle: if the physics were sufficiently developed to allow real-space derivations for each member of each model, and one could use these to adduce common features then universality would likely be explained; al25 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 ternatively a Kadanoff-type approach might be extended for a more generalised account of universality. In §2 I argued that SpecE and ComE explanations were to be distinguished: the real-space RG currently only provides SpecE for certain models but is insufficient for ComE. On neither approach to the RG do we have a fully worked out bottom-up explanation of universality. Nonetheless I claim that the field-theoretic approach is adequate just because we have a generalised account of universality on that approach, which provides conditions that, if satisfied, predict common behaviour across a class of systems. 5 Conclusion Batterman suggests the RG explanation of universality works by: first constructing an enormous abstract space each point of which might represent a real fluid, a possible fluid, a solid, etc. Next one induces on this space a transformation that has the effect, essentially, of eliminating degrees of freedom by some kind of averaging rule. ... Those systems/models (points in the space) that flow to the same fixed point are in the same universality class–the universality class is delimited–and they will exhibit the same macro-behavior. (Batterman 2017, 8-9) My aim in this paper has been to spell out the physical details which underpin the quote above. In so doing I argued that the picture Batterman provides of the RG explanation is not workable on the real-space approach, but that it is consistent with the field-theoretic approach. However I claimed that, due to certain outstanding technical lacunae, the field-theoretic RG approach is better conceived as providing an explanation that adduces common aspects of the various systems which exhibit universality, and demonstrates that such common aspects are sufficient for universal behaviour. The real-space approach starts with a model and derives the critical exponents on the basis of that model. It is difficult to see how this approach adequately explains the phenomenon that heterogeneous systems have identical critical behaviour. The field-theoretic approach, on the other hand, explains universality by 26 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 positing an effective Hamiltonian and deriving the critical exponents from that. That this Hamiltonian is demonstrably general grounds the explanation of universality. References Batterman, Robert. 2000. \"Multiple Realizability and Universality.\" BJPS 51 (1): 115–145. . 2016. \"Philosophical Implications of Kadanoff's work on the Renormalization Group.\" Journal of Statistical Physics (Forthcoming). . 2017. \"Autonomy of Theories: An Explanatory Problem.\" Noûs. Batterman, Robert, and Collin Rice. 2014. \"Minimal Model Explanations.\" Philosophy of Science 81 (3): 349–376. Binney, James, Nigel Dowrick, Andrew Fisher, and Mark Newman. 1992. The Theory of Critical Phenomena: an Introduction to the Renormalization Group. Oxford: Clarendon Press, Oxford. Bueno, Otávio, and Steven French. 2011. \"How Theories Represent.\" BJPS 62:857– 894. Butterfield, Jeremy. 2014. \"Reduction, Emergence, and Renormalization.\" The Journal of Philosophy 111 (1): 5–49. Butterfield, Jeremy, and Nazim Bouatta. 2011. \"Emergence and Reduction Combined in Phase Transitions.\" arXiv preprint arXiv:1104.1371. Callender, Craig, and Tarun Menon. 2013. \"Turn and Face the Strange ... Ch-chchanges Philosophical Questions Raised by Phase Transitions.\" In The Oxford Handbook of Philosophy of Physics, edited by Robert W. Batterman, 189–223. OUP. Cardy, John. 1996. Scaling and Renormalization in Statistical Physics. CUP. Cheung, Anson. 2011. \"Phase Transitions and Collective Phenomena.\" Cambridge University Lecture Notes. Fisher, Michael. 1974. \"The renormalization group in the theory of critical behavior.\" Reviews of Modern Physics 46 (4): 597–616. 27 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 Fisher, Michael. 1998. \"Renormalization group theory: Its basis and formulation in statistical physics.\" Reviews of Modern Physics 70 (2): 653–681. Figures reproduced with permission of AMERICAN PHYSICAL SOCIETY via Copyright Clearance Center. Goldenfeld, Nigel. 1992. Lectures on phase transitions and the renormalization group. Vol. 5. Addison-Wesley Reading, MA. Jansson, Lina, and Juha Saatsi. 2016. \"Explanatory Abstractions.\" BJPS. Kadanoff, Leo. 1971. \"Critical Behavior. Universality and Scaling.\" In Proceedings of the International School of Physics \"Enrico Fermi\" Course LI, edited by M. S. Green, 100–117. Italian Physical Society Academic Press. . 2013. \"Theories of Matter: Infinities and Renormalization.\" In The Oxford Handbook of Philosophy of Physics, edited by Robert W. Batterman, 141–188. OUP. Klein, Bill, Harvey Gould, and Jan Tobochnik. 2012. \"Kinetics of Phase Transitions.\" stp.clarku.edu/kleinnotes/. Lee, Tsung-Dao, and Chen-Ning Yang. 1952. \"Statistical Theory of Equations of State and Phase Transitions. II. Lattice Gas and Ising Model.\" Physical Review 87 (3): 410. Mainwood, Paul. 2006. \"Is More Different? Emergent Properties in Physics.\" PhD diss., University of Oxford. Morrison, Margaret. 2014. \"Complex Systems and Renormalization Group Explanations.\" Philosophy of Science 81, no. 5 (December): 1144–1156. Niss, Martin. 2005. \"History of the Lenz-Ising model 1920–1950: From Ferromagnetic to Cooperative Phenomena.\" Archive for history of exact sciences 59 (3): 267–318. Onsager, Lars. 1944. \"Crystal Statistics. I. A Two-Dimensional Model with an Order-Disorder Transition.\" Physical Review 65:117–149. Pelissetto, Andrea, and Ettore Vicari. 2002. \"Critical Phenomena and Renormalization Group Theory.\" Physics Reports 368 (6): 549–727. Reutlinger, Alexander. 2014. \"Why Is There Universal Macrobehavior? Renormalization Group Explanation as Noncausal Explanation.\" Philosophy of Science 81 (5): 1157–1170. 28 Copyright The Philosophy of Science Association 2018 Preprint (not copyedited or formatted) Please use DOI when citing or quoting. DOI: 10.1086/696812 Sengers, Jan, and Joseph Shanks. 2009. \"Experimental Critical-Exponent Values for Fluids.\" Journal of Statistical Physics 137 (5-6): 857–877. Stanley, Eugene. 1999. \"Scaling, universality, and renormalization: Three pillars of modern critical phenomena.\" Reviews of modern physics 71 (2): S358–S366. Vause, C., and J. Sak. 1980. \"Non-Ising-like effects in the liquid-vapor transition: Equations of state.\" Phys. Rev. A 21 (6): 2099–2114. Woodward, James. 2003. Making Things Happen: A Theory of Causal Explanation. OUP. . 2016. Explanatory Autonomy: The Role of Proportionality, Stability, and Conditional Irrelevance. philsci-archive.pitt.edu/12629.",
    "meta": {
      "title": "On the Renormalization Group Explanation of Universality",
      "type": "info:eu-repo/semantics/article",
      "creator": "Franklin, Alexander",
      "subject": "Philosophy",
      "description": "It is commonly claimed that the universality of critical phenomena is explained through particular applications of the renormalization group. This article has three aims: to clarify the structure of the explanation of universality, to discuss the physics of such RG explanations, and to examine the extent to which universality is thus explained. The derivation of critical exponents proceeds via a real-space or a field-theoretic approach to the RG. Building on work by Mainwood, this article argues that these approaches ought to be distinguished: while the field-theoretic approach explains universality, the real-space approach fails to provide an adequate explanation.",
      "date": "2018",
      "identifier": "oai:philarchive.org/rec/FRAOTR-5",
      "language": "en",
      "datestamp": "2020-04-16T05:00:54Z"
    },
    "sample_row_n": 10010
  }
}